# GetBarIndexFromReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..GetBarIndexFromReference Method
RebarInSystem Class See Also
---
Given a reference that represents a part of a bar, this method will return the bar index.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public int GetBarIndexFromReference(
	Reference barReference
)
```

Visual Basic
---
```text
Public Function GetBarIndexFromReference ( _
	barReference As Reference _
) As Integer
```

Visual C++
---
```text
public:
int GetBarIndexFromReference(
	Reference^ barReference
)
```

# ### Parameters
barReference
    Type: Autodesk.Revit.DB..::..Reference The Reference of the RebarInSystem element.
# ### Return Value
The bar index the reference refers to.
# Remarks
The method returns an index between 0 and NumberOfBarPositions - 1 if it the given reference represents a part of a bar. Otherwise will return -1.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace